In [25]:
import numpy as np
import pandas as pd

In [26]:
df = pd.read_csv("car data.csv")
df.head()

,Car_Name,company,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner
0,ritz,maruti suzuki,2014,3.35,5.59,27000,Petrol,Dealer,Manual,0
1,sx4,maruti suzuki,2013,4.75,9.54,43000,Diesel,Dealer,Manual,0
2,ciaz,maruti suzuki,2017,7.25,9.85,6900,Petrol,Dealer,Manual,0
3,wagon r,maruti suzuki,2011,2.85,4.15,5200,Petrol,Dealer,Manual,0
4,swift,maruti suzuki,2014,4.60,6.87,42450,Diesel,Dealer,Manual,0

In [27]:
from sklearn.ensemble import RandomForestRegressor
from sklearn.model_selection import train_test_split

In [28]:
from sklearn.preprocessing import LabelEncoder
encoder = LabelEncoder()

In [29]:
df.isnull().any()

Car_Name         False
company          False
Year             False
Selling_Price    False
Present_Price    False
Kms_Driven       False
Fuel_Type        False
Seller_Type      False
Transmission     False
Owner            False
dtype: bool

In [30]:
df['Car_Name'].value_counts()

city                      26
corolla altis             16
verna                     14
fortuner                  11
brio                      10
                          ..
Honda Activa 125           1
Honda CB Unicorn           1
Hero  CBZ Xtreme           1
Hyosung GT250R             1
Hero Honda CBZ extreme     1
Name: Car_Name, Length: 98, dtype: int64

In [31]:
pd.get_dummies(df['Transmission'])

     Automatic  Manual
0            0       1
1            0       1
2            0       1
3            0       1
4            0       1
..         ...     ...
296          0       1
297          0       1
298          0       1
299          0       1
300          0       1

[301 rows x 2 columns]

In [32]:
df['Transmission'] = pd.get_dummies(df['Transmission'])

In [38]:
df =pd.get_dummies(data = df ,columns = ['Fuel_Type'])

In [34]:
df['Seller_Type'] = pd.get_dummies(df['Seller_Type'])

In [39]:
df.head()

,Car_Name,company,Year,Selling_Price,Present_Price,Kms_Driven,Seller_Type,Transmission,Owner,Fuel_Type_CNG,Fuel_Type_Diesel,Fuel_Type_Petrol
0,ritz,maruti suzuki,2014,3.35,5.59,27000,1,0,0,0,0,1
1,sx4,maruti suzuki,2013,4.75,9.54,43000,1,0,0,0,1,0
2,ciaz,maruti suzuki,2017,7.25,9.85,6900,1,0,0,0,0,1
3,wagon r,maruti suzuki,2011,2.85,4.15,5200,1,0,0,0,0,1
4,swift,maruti suzuki,2014,4.60,6.87,42450,1,0,0,0,1,0

In [40]:
df['Car_Name'] = encoder.fit_transform(df['Car_Name'])

In [41]:
df['company'] = encoder.fit_transform(df['company'])

In [42]:
df.head()

,Car_Name,company,Year,Selling_Price,Present_Price,Kms_Driven,Seller_Type,Transmission,Owner,Fuel_Type_CNG,Fuel_Type_Diesel,Fuel_Type_Petrol
0,90,4,2014,3.35,5.59,27000,1,0,0,0,0,1
1,93,4,2013,4.75,9.54,43000,1,0,0,0,1,0
2,68,4,2017,7.25,9.85,6900,1,0,0,0,0,1
3,96,4,2011,2.85,4.15,5200,1,0,0,0,0,1
4,92,4,2014,4.60,6.87,42450,1,0,0,0,1,0

In [47]:
# Model Building
X = df.drop(labels = ['Selling_Price'],axis = 'columns')
y = df['Selling_Price']

In [48]:
X_train,X_test,y_train,y_test = train_test_split(X,y,test_size= 0.25)

In [49]:
forest = RandomForestRegressor()

In [50]:
model=  forest.fit(X_train,y_train)

In [51]:
y_pred = model.predict(X_test)

In [52]:
from sklearn.metrics import r2_score

In [53]:
r2_score(y_test,y_pred)

0.9368961950409621